namespace Conditional_Statements
{
    using System;
    using System.Collections.Generic;
    using System.Linq;
    using System.Text;
    using System.Threading.Tasks;

    public class ConditionalStatements
    {
        public static void Main(string[] args)
        {
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            /*
            Опеаратори за сравняване на числа, текст, дати:
            <       по-малко.
            >       по-голямо.
            <=      по-малко и равно.
            >=      по-голямо и равно.
            ==      проверка за равенство.
            !=      проверка за различно.

            Оператори за логически операции:
            &&      логическо "И" - Truth само ако и оператора и операнда за truth.
            ||      логическо "ИЛИ" - Truth ако поне един от оператора или операнда са truth.
            ^       логическо "Изключващо ИЛИ" - Truth само ако оператора и операнда са различни.
            !       логическо "НЕ". Работи САМО върху булеви променливи. - Truth става False и обратното.
            */
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            var grade = double.Parse(Console.ReadLine());                   //Проверка if.
            if (grade >= 5.50)
            {
                Console.WriteLine("Excellent!");
            }
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            var grade2 = double.Parse(Console.ReadLine());                  //Проверка if-else.
            if (grade2 >= 5.50)
            {
                Console.WriteLine("Excellent!");
            }
            else
            {
                Console.WriteLine("Not excellent.");
            }
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            var num = int.Parse(Console.ReadLine());                        //Проверка if-else if-else.
            if (num == 1)
            {
                Console.WriteLine("one");
            }
            else if (num == 2)
            {
                Console.WriteLine("two");
            }
            else if (num == 3)
            {
                Console.WriteLine("three");
            }
            else
            {
                Console.WriteLine("number too big");
            }
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            var age = double.Parse(Console.ReadLine());                     //Вложени проверки.
            var gender = Console.ReadLine();
            if (age < 16)
            {
                if (gender == "m")
                {
                    Console.WriteLine("Master");
                }
                else if (gender == "f")
                {
                    Console.WriteLine("Miss");
                }
            }
            else
            {
                if (gender == "m")
                {
                    Console.WriteLine("Mr.");
                }
                else if (gender == "f")
                {
                    Console.WriteLine("Ms.");
                }
            }
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            int day = int.Parse(Console.ReadLine());                        //Проверка switch-case-default.
            switch (day)
            {
                case 1: Console.WriteLine("Monday"); break;
                case 2: Console.WriteLine("Tuesday"); break;                //Ако липсва "break", следващите етикети се присъединяват към настоящият "case", докато се срещне "break".
                case 7: Console.WriteLine("Sunday"); break;
                default: Console.WriteLine("Error!"); break;
            }
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            int ax = 6;                                                     //Условен  оператор ?:.
            int bx = 4;
            Console.WriteLine(ax > bx ? "ax > bx" : "bx <= ax");            //Ще се отпечата "ax > bx".
            int num2 = ax == bx ? 1 : -1;                                   //num2 ще приеме стойност -1.
                                                                            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            string name = null;                                             //?? се поставя между два операнда и връща левия операнд само ако той няма стойност null, в противен случай връща десния.
            Console.WriteLine(name ?? "no name");                           //(no name).
                                                                            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            try                                                             //Проверка за парсване Try-catch. Ако int.Parse(…) гръмне, ще се изпълни catch { … } блокът.
            {
                Console.Write("Enter number: ");
                int j = int.Parse(Console.ReadLine());
            }
            catch
            {
                Console.WriteLine("Invalid number.");
            }
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
        }
    }
}
