namespace Arrays
{
    using System;
    using System.Collections.Generic;
    using System.Linq;
    using System.Text;
    using System.Threading.Tasks;

    public class Arrays
    {
        public static void Main(string[] args)                 //string[] args - При стартиране на козолна програма указваме папка в/с която да работи -> myprogram.exe --folder "c:\movies"
        {
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            //Дефиниране на масив.
            int[] numbers1 = new int[100];
            var numbers2 = new int[100];
            var booleans = new bool[50];                    //От булеви стойности.
            var numbers4 = new int[] { 1, 2, 3, 4, 5 };     //Директно в место да му даваме размера на масива, можем да го инициализираме с всички стойности.
                                                            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
                                                            //Четене и запис от масив.
            var numbersTwo = new int[5];
            numbersTwo[2] = 43;                //Записва във 3-та клетка 43 (Клетките са от 0 до n-1).
            numbersTwo[4] = 67;
            Console.WriteLine(numbersTwo[2]);  //Отпечатай 3-та клетка в конзолата.
                                               /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
                                               //Запис в масив с for цикъл. Размера на масива се задава от юзера.
            var numberOfElements = int.Parse(Console.ReadLine());   //Юзера задава колко елемента ще е масива.

            var numbers = new int[numberOfElements];

            for (int i = 0; i < numbers.Length; i++)
            {
                numbers[i] = int.Parse(Console.ReadLine());
            }
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            //Печатане на масив с for цикъл.
            for (int r = 0; r < numbers.Length; r++)
            {
                Console.WriteLine(numbers[r]);
            }
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            //Запис в масив от един ред.
            string values = Console.ReadLine(); //2 8 30 25 40 72 -2 44 56

            string[] items = values.Split(' '); //.Select(int.Parse).ToArray();

            int[] arr = new int[items.Length];

            for (int i = 0; i < items.Length; i++)
            {
                arr[i] = int.Parse(items[i]);
            }
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            //Сплитване на текст. Split взима всичко между запетаите и го слага в масив.
            string text = "1,2,3,4,5";
            var splitText = text.Split(',');                    //Може и повече от един символ да се сплитва - Split(',', '!', '6').  
            var numbersTree = new int[splitText.Length];        //Това горното може да се опрости и да отпадне цикъла с:  var splitText = text.Split(',').Select(int.Parse).ToArray();
            for (int j = 0; j < numbersTree.Length; j++)
            {
                var currentText2 = splitText[j];
                var curretNumber2 = int.Parse(currentText2);
                numbersTree[j] += curretNumber2;
            }

            //Сплитване на повече символи в един текст.
            var textSix = "Zdrasti, az sym Ivo! Vodq lekciq sega.";
            var separators = new char[] { ',', '.', '!', ' ' };
            var words = textSix.Split(separators, StringSplitOptions.RemoveEmptyEntries);
            foreach (var word in words)
            {
                Console.WriteLine(word);
            }

            //Пример за често срещана ситуация за сплит:
            var result = "1, 2, 3, 4, 5".Split(new char[] { ' ', ',' }, StringSplitOptions.RemoveEmptyEntries).Select(int.Parse).ToArray();

            //Използване на Join!
            //Искаме да се отпечата на козолата 1 2 3 4 5
            var numbersTen = new int[] { 1, 2, 3, 4, 5 };
            var resultTree = string.Join(" ", numbersTen);  //Ако искаме всяка цифра да е на нов ред, вместо " " -> Environment.NewLine, или "\n"
            Console.WriteLine(resultTree);

            //Използване на StringBuilder.
            //Искаме да се отпечата на козолата 1 2 3 4 5
            var numbersNine = new int[] { 1, 2, 3, 4, 5 };
            var resultTwo = new StringBuilder();
            for (int i = 0; i < numbersNine.Length; i++)
            {
                resultTwo.Append(numbersNine[i]);

                if (i != numbersNine.Length - 1)
                {
                    resultTwo.Append(" ");
                }
            }
            Console.WriteLine(resultTwo.ToString());
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            //Пълнене на масив с азбуката.
            var alphabet = new char[26];
            for (char index = 'a'; index <= 'z'; index++)
            {
                alphabet[index - 'a'] = index;
            }
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            //Принтиране на Масив с foreach цикъл:
            int[] arr1 = { 10, 20, 30, 40, 50 };
            foreach (var element in arr1)
            {
                Console.WriteLine(element);
            }
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            //Понеже стринговете са READONLY масиви, за да заместим символ в стринг, трябва да го конвертираме в истински масив:
            var textSeven = "abcd".ToCharArray();
            textSeven[2] = 'f';
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            //String е масив от символи -> Console.WriteLine(text[2]); -> ще отпечатя 3-ия символ от текста.
            //.Trim() - Маха интервалите в един низ.
            //.Length - Връща броя на елементите в низ.
            /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
        }
    }
}
