using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Целочислено_делене
{
    class Целочислено_делене
    {
        static void Main(string[] args)
        {
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
            int a = 10;
            var b = 10;
            Console.WriteLine(a / 4);                   //Резултата не е дробно число 2.5, а е 2, защото е int.
            Console.WriteLine(b / 4.0);                 //Резултат e дробно делене.
            Console.WriteLine(10 % 4);                  //Целочислено делене. 2*4=8, 10-8=2 остатък ->2.
            Console.WriteLine(59.7 % 1);                //Връща дробната част.
            Console.WriteLine(59 % 2);                  //Проверка за честност като се проверява резултата (остатъка) дали е 0 (четно), различно от нула (нечетно).                                  
            Console.WriteLine(59 % 10);                 //Резултата е 9. Напрактика % делението връща ЕДЕНИЦАТА.
            Console.WriteLine(59 / 10);                 //Резултата е 5. Напрактика int делението връща ДЕСЕТИЦАТА.
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
        }
    }
}
