using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Форматиране_на_текст
{
    class Форматиране_на_текст
    {
        static void Main(string[] args)
        {
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
                    Console.WriteLine("{0:0.00}", 1);                               //Output: 1,00    
                    Console .WriteLine( "{0:#.##}" , 0.234);                        //Output: ,23    
                    Console .WriteLine( "{0:#####}" , 12345.67);                    //Output: 12346    
                    Console .WriteLine( "{0:(0#) ### ## ##} " , 29342525);          //Output: (02) 934 25 25    
                    Console .WriteLine( "{0:%##}" , 0.234);                         //Output: %23  
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
                    Console.WriteLine("{0:C2}", 123.456);                           //Output: 123,46 лв.    
                    Console .WriteLine( "{0:D6}" , - 1234);                         //Output: - 001234
                    Console.WriteLine("{0:E2}", 123);                               //Output: 1,23 Е +002    
                    Console .WriteLine( "{0:F2}" , - 123.456);                      //Output: - 123,46    
                    Console .WriteLine( "{0:N2}" , 1234567.8);                      //Output: 1 234 567,80    
                    Console .WriteLine( "{0:P}" , 0.456);                           //Output: 45,60 %    
                    Console .WriteLine( "{0:X}" , 254);                             //Output: FE    
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
                    Console.WriteLine("{0,6}", 123);                                //6 означава броя позиции в които да се подравни стринга.
                    Console.WriteLine("{0,6}", 1234);
                    Console.WriteLine("{0,6}", 12);
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
                    Console.WriteLine("{0: G }", DayOfWeek.Wednesday);              //Представя енумерацията като стринг (Wednesday).
                    Console.WriteLine("{0:D}", DayOfWeek.Wednesday);                //Представя енумерацията като число (3).
                    Console.WriteLine("{0:X}", DayOfWeek.Wednesday);                //Представя енумерацията като число в шестнадесетичната бройна система и с осем цифри (00000003).
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
        }
    }
}
